[
    {
        "title": "display",
        "image": "",
        "doc": "This defines a <strong>flex</strong> container, inline or block depending on the given value. It enables a <strong>flex</strong> context for all its direct children.<br>Note that <em>CSS</em> columns have no effect on a <strong>flex</strong> container.",
        "values": [
            {
                "key": "flex",
                "text": "(default)"
            },
            {
                "key": "inline-flex",
                "text": "makes the <strong>flex</strong> container display inline. That is the only difference between <strong>display: inline-flex</strong> and <strong>display: flex</strong>. A similar comparison can be made between <strong>display: inline-block</strong> and <strong>display: block</strong>"
            }
        ]
    },
    {
        "title": "flex-direction",
        "image": "",
        "doc": "This establishes the main-axis, thus defining the direction <strong>flex</strong> items are placed in the <strong>flex</strong> container. <em>Flexbox</em> is (aside from optional wrapping) a single-direction layout concept. Think of <strong>flex</strong> items as primarily laying out either in horizontal rows or vertical columns.",
        "values": [
            {
                "key": "row",
                "text": "(default) left to right in <strong>ltr</strong>; right to left in <strong>rtl</strong>"
            },
            {
                "key": "row-reverse",
                "text": "right to left in <strong>ltr</strong>; left to right in <strong>rtl</strong>"
            },
            {
                "key": "column",
                "text": "same as <strong>row</strong> but top to bottom"
            },
            {
                "key": "column-reverse",
                "text": "same as <strong>row-reverse</strong> but bottom to top"
            }
        ]
    },
    {
        "title": "flex-wrap",
        "image": "",
        "doc": "By default, <strong>flex</strong> items will all try to fit onto one line. You can change that and allow the items to wrap as needed with this property.",
        "values": [
            {
                "key": "nowrap",
                "text": "(default) all <strong>flex</strong> items will be on one line."
            },
            {
                "key": "wrap",
                "text": "<strong>flex</strong> items will wrap onto multiple lines, from top to bottom."
            },
            {
                "key": "wrap-reverse",
                "text": "<strong>flex</strong> items will wrap onto multiple lines from bottom to top."
            }
        ]
    },
    {
        "title": "justify-content",
        "image": "",
        "doc": "This defines the alignment along the main axis. It helps distribute extra free space left over when either all the <strong>flex</strong> items on a line are inflexible, or are flexible but have reached their maximum size. It also exerts some control over the alignment of items when they overflow the line.",
        "values": [
            {
                "key": "flex-start",
                "text": "(default) items are packed toward the start line."
            },
            {
                "key": "flex-end",
                "text": "items are packed toward the end line."
            },
            {
                "key": "center",
                "text": "items are centered along the line."
            },
            {
                "key": "space-between",
                "text": "items are evenly distributed in the line; first item is on the start line, last item on the end line."
            },
            {
                "key": "space-around",
                "text": "items are evenly distributed in the line with equal space around them. Note that visually the spaces aren't equal, since all the items have equal space on both sides. The first item will have one unit of space against the container edge, but two units of space between the next item because that next item has its own spacing that applies."
            },
            {
                "key": "space-evenly",
                "text": "items are distributed so that the spacing between any two items (and the space to the edges) is equal."
            }
        ]
    },
    {
        "title": "align-items",
        "image": "",
        "doc": "This defines the default behavior for how <strong>flex</strong> items are laid out along the cross axis on the current line. Think of it as the <strong>justify-content</strong> version for the cross-axis (perpendicular to the main-axis).",
        "values": [
            {
                "key": "stretch",
                "text": "(default) stretch to fill the container (still respect <strong>min-width</strong>/<strong>max-width</strong>)."
            },
            {
                "key": "flex-start",
                "text": "cross-start margin edge of the items is placed on the cross-start line."
            },
            {
                "key": "flex-end",
                "text": "cross-end margin edge of the items is placed on the cross-end line."
            },
            {
                "key": "center",
                "text": "items are centered in the cross-axis."
            },
            {
                "key": "baseline",
                "text": "items are aligned such as their baselines align."
            }
        ]
    },
    {
        "title": "align-content",
        "image": "",
        "doc": "This aligns a <strong>flex</strong> container's lines within when there is extra space in the cross-axis, similar to how <strong>justify-content</strong> aligns individual items within the main-axis.<br><b>Note:</b> this property has no effect when there is only one line of <strong>flex</strong> items.",
        "values": [
            {
                "key": "flex-start",
                "text": "lines packed to the start of the container."
            },
            {
                "key": "flex-end",
                "text": "lines packed to the end of the container."
            },
            {
                "key": "center",
                "text": "lines packed to the center of the container."
            },
            {
                "key": "space-between",
                "text": "lines evenly distributed, the first line is at the start of the container while the last one is at the end."
            },
            {
                "key": "space-around",
                "text": "lines evenly distributed with equal space around each line."
            },
            {
                "key": "stretch",
                "text": "(default) lines stretch to take up the remaining space."
            }
        ]
    },
    {
        "title": "flex-flow",
        "image": "",
        "doc": "(Applies to: parent <strong>flex</strong> container element)<br>This is a shorthand for the <strong>flex-direction</strong> and <strong>flex-wrap</strong> properties, which together define the <strong>flex</strong> container's main and cross axes. The default value is <strong>row nowrap</strong>.",
        "values": ""
    },
    {
        "title": "order",
        "image": "",
        "doc": "By default, <strong>flex</strong> items are laid out in the source order. However, the <strong>order</strong> property controls the order in which they appear in the <strong>flex</strong> container.",
        "values": ""
    },
    {
        "title": "flex-grow",
        "image": "",
        "doc": "This defines the ability for a <strong>flex</strong> item to grow if necessary. It accepts a unitless value that serves as a proportion. It dictates what amount of the available space inside the <strong>flex</strong> container the item should take up.<br>If all items have <strong>flex-grow</strong> set to <strong>1</strong>, the remaining space in the container will be distributed equally to all children. If one of the children has a value of <strong>2</strong>, the remaining space would take up twice as much space as the others (or it will try to, at least).<br>Negative numbers are invalid.",
        "values": ""
    },
    {
        "title": "flex-shrink",
        "image": "",
        "doc": "This defines the ability for a <strong>flex</strong> item to shrink if necessary.<br>Negative numbers are invalid.",
        "values": ""
    },
    {
        "title": "flex-basis",
        "image": "",
        "doc": "This defines the default size of an element before the remaining space is distributed. It can be a length (e.g. 20%, 5rem, etc.) or a keyword. The <strong>auto</strong> keyword means \"look at my width or height property\" (which was temporarily done by the <strong>main-size</strong> keyword until deprecated). The <strong>content</strong> keyword means \"size it based on the item's content\" - this keyword isn't well supported yet, so it's hard to test and harder to know what its brethren <strong>max-content</strong>, <strong>min-content</strong>, and <strong>fit-content</strong> do.<br>If set to <strong>0</strong>, the extra space around content isn't factored in. If set to <strong>auto</strong>, the extra space is distributed based on its <strong>flex-grow</strong> value.",
        "values": ""
    },
    {
        "title": "flex",
        "image": "",
        "doc": "This is the shorthand for <strong>flex-grow</strong>, <strong>flex-shrink</strong> and <strong>flex-basis</strong> combined. The second and third parameters (<strong>flex-shrink</strong> and <strong>flex-basis</strong>) are optional. Default is <strong>0 1 auto</strong>.",
        "values": ""
    },
    {
        "title": "align-self",
        "image": "",
        "doc": "This allows the default alignment (or the one specified by <strong>align-items</strong>) to be overridden for individual <strong>flex</strong> items.<br>Note that <strong>float</strong>, <strong>clear</strong> and <strong>vertical-align</strong> have no effect on a <strong>flex</strong> item. ",
        "values": [
            {
                "key": "flex-start",
                "text": "cross-start margin edge of the item is placed on the cross-start line."
            },
            {
                "key": "flex-end",
                "text": "cross-end margin edge of the item is placed on the cross-end line."
            },
            {
                "key": "center",
                "text": "item is centered in the cross-axis."
            },
            {
                "key": "baseline",
                "text": "item is aligned such as its baseline align."
            },
            {
                "key": "stretch",
                "text": "(default) item stretch to take up the remaining space."
            }
        ]
    }
]
